#include <fmt/format.h>
#include <gtest/gtest.h>

#include "calc.hpp"

//=======================================================================

// Тест: Успешное сложение 2 целых чисел
TEST(Calc, add) { ASSERT_EQ(::tools::calculator::Calculator::add(5, 2), 7) << "При сложении двух чисел 5 и 2 должно быть 7"; }

// Тест: Успешное вычитание 2 целых чисел
TEST(Calc, mul) { ASSERT_EQ(::tools::calculator::Calculator::mul(5, 2), 10) << "При умножении двух чисел 5 и 2 должно быть 10"; }

//=======================================================================